# Стоимость трафика
Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет ﻿A﻿ рублей в месяц. За эту стоимость Костя получает ﻿B﻿ мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет стоить ему ﻿C﻿ рублей.

Костя планирует потратить ﻿D﻿ мегабайт интернет-трафика в следующий месяц. Помогите ему сосчитать, во сколько рублей ему обойдется интернет.
Формат входных данных

Вводится ﻿4﻿ целых положительных числа ﻿A,B,C,D(1≤A,B,C,D≤100)﻿ — стоимость тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем месяце. Числа во входном файле разделены пробелами.

Формат выходных данных

Выведите одно натуральное число — суммарные расходы Кости на интернет.



Замечание

В первом примере Костя сначала оплатит пакет интернета, после чего потратит на ﻿5﻿ мегабайт больше, чем разрешено по тарифу. Следовательно, за ﻿5﻿ мегабайт он дополняет отдельно, получившаяся стоимость ﻿100+12×5=160﻿ рублей.

Пример 2
Ввод: 100  10  12  1   
Вывод: 100   


ОТВЕТ:

```java
import java.util.Scanner;

public class MobileOperator {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int A = scanner.nextInt(); // стоимость тарифа
        int B = scanner.nextInt(); // размер тарифа
        int C = scanner.nextInt(); // стоимость каждого лишнего мегабайта
        int D = scanner.nextInt(); // размер интернет-трафика в следующем месяце
        int cost = A; // начальная стоимость - абонентская плата
        if (D > B) { // если превышен лимит трафика
            int extraTraffic = D - B; // определяем количество лишних мегабайт
            cost = cost + extraTraffic * C; // добавляем стоимость лишних мегабайт
        }
        System.out.println(cost); // выводим итоговую стоимость
    }
}
```
