# Стоимость трафика
Костя подключен к мобильному оператору «Мобайл». Абонентская плата Кости составляет ﻿A﻿ рублей в месяц. За эту стоимость Костя получает ﻿B﻿ мегабайт интернет-трафика. Если Костя выйдет за лимит трафика, то каждый следующий мегабайт будет стоить ему ﻿C﻿ рублей.

Костя планирует потратить ﻿D﻿ мегабайт интернет-трафика в следующий месяц. Помогите ему сосчитать, во сколько рублей ему обойдется интернет.
Формат входных данных

Вводится ﻿4﻿ целых положительных числа ﻿A,B,C,D(1≤A,B,C,D≤100)﻿ — стоимость тарифа Кости, размер тарифа Кости, стоимость каждого лишнего мегабайта, размер интернет-трафика Кости в следующем месяце. Числа во входном файле разделены пробелами.

Формат выходных данных

Выведите одно натуральное число — суммарные расходы Кости на интернет.



Замечание

В первом примере Костя сначала оплатит пакет интернета, после чего потратит на ﻿5﻿ мегабайт больше, чем разрешено по тарифу. Следовательно, за ﻿5﻿ мегабайт он дополняет отдельно, получившаяся стоимость ﻿100+12×5=160﻿ рублей.

Пример 2
Ввод: 100  10  12  1   
Вывод: 100   


ОТВЕТ:

```java
import java.util.Scanner;

public class MobileOperator {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int A = scanner.nextInt(); // стоимость тарифа
        int B = scanner.nextInt(); // размер тарифа
        int C = scanner.nextInt(); // стоимость каждого лишнего мегабайта
        int D = scanner.nextInt(); // размер интернет-трафика в следующем месяце
        int cost = A; // начальная стоимость - абонентская плата
        if (D > B) { // если превышен лимит трафика
            int extraTraffic = D - B; // определяем количество лишних мегабайт
            cost = cost + extraTraffic * C; // добавляем стоимость лишних мегабайт
        }
        System.out.println(cost); // выводим итоговую стоимость
    }
}
```



# Рулет.


Ваня принес на кухню рулет, который он хочет разделить с коллегами. Для этого он хочет
разрезать
рулет на _N_ равных
частей. Разумеется, рулет можно резать только поперек. Соотвественно,
Костя сделает _N_ - 1 разрез ножом через равные промежутки.

По возвращению с кофе-брейка Ваня задумался — а можно ли было обойтись меньшим числом
движений, будь нож Вани бесконечно длинным (иначе говоря, если он мог бы сделать
сколько угодно разрезов за раз, если эти разрезы лежат на одной прямой)?
Считается, что места для разрезов намечены заранее, и все разрезы делаются с ювелирной
точностью.

Оказывается, что можно. Например, если Ваня хотел бы разделить рулет на 4 части, он мог бы
обойтись двумя разрезами — сначала он разделил бы рулет на две половинки, а потом совместил
бы две половинки и разрезал обе пополам одновременно.

Вам дано число _N_, требуется сказать, каким минимальным числом разрезов можно обойтись.

#### Формат входных данных

Дано одно натуральное число _N_(1≤_N_≤2×10<sup>9</sup>) - количество людей на кофе-брейке.

#### Формат выходных данных

Выведите одно число — минимальное число движений, которое придется сделать Косте.

#### Замечание

Чтобы разрезать рулет на 6 частей, Ване сначала придется разрезать его на две равные части,
после чего совместить две половинки и сделать два разреза.

Чтобы разрезать рулет на 5 частей, Ване понадобится разделить его в соотношении 2:3, после
чего совместить два рулета по левому краю и разрезать бОльший рулет на одинарные
кусочки — меньший тоже разделится на одинарные.

## Примеры данных

### Пример 1

**Ввод**<br>
6<br>

**Вывод**<br>
3

### Пример 2

**Ввод**<br>
5<br>

**Вывод**<br>
3<br>

---

# **Решение**

````java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        int n = scanner.nextInt();

        int result = cuts(n);

        System.out.println(result);

        scanner.close();
    }

    static int cuts(int n) {
        if (n <= 1) {
            return 0;
        }
        if (n % 2 == 0) {
            return 1 + cuts(n / 2);
        }
        return 1 + cuts(n - 1);
    }
}
